Terraform plan for __production__
<details>
<summary>Plan: 106 to add, 6 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_user_policy_attachment.eks_broker_policies["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_user_policy_attachment" "eks_broker_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + user       = "ssb-eks-broker"
    }

  # aws_iam_user_policy_attachment.eks_broker_policies["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_user_policy_attachment" "eks_broker_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + user       = "ssb-eks-broker"
    }

  # cloudfoundry_service_instance.solrcloud_broker_k8s_cluster will be destroyed
  # (because cloudfoundry_service_instance.solrcloud_broker_k8s_cluster is not in configuration)
  - resource "cloudfoundry_service_instance" "solrcloud_broker_k8s_cluster" {
      - id                             = "1cac946a-e89e-4378-8049-788c278d45ce" -> null
      - name                           = "ssb-solrcloud-k8s" -> null
      - recursive_delete               = false -> null
      - replace_on_params_change       = false -> null
      - replace_on_service_plan_change = false -> null
      - service_plan                   = "07996909-c99a-4f7b-b154-4330e363693b" -> null
      - space                          = "9a1db116-0180-42be-8ffa-7944dcf6bf50" -> null
      - tags                           = [
          - "k8s",
        ] -> null

      - timeouts {
          - create = "60m" -> null
          - delete = "40m" -> null
          - update = "90m" -> null
        }
    }

  # cloudfoundry_user_provided_service.ssb-solrcloud-k8s will be created
  + resource "cloudfoundry_user_provided_service" "ssb-solrcloud-k8s" {
      + credentials_json = (sensitive value)
      + id               = (known after apply)
      + name             = "ssb-solrcloud-k8s"
      + space            = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
    }

  # module.broker_eks.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
        id                         = "150102ab-ccc2-4765-aebc-55322db97a8b"
      ~ id_bg                      = "************************************" -> (known after apply)
      ~ instances                  = 1 -> 2
      ~ memory                     = 512 -> 1024
        name                       = "ssb-eks"
      ~ source_code_hash           = "oFIHz3KGgRHHwrHWFCy07jNbdXth2GAsz7EckLc7jR8=" -> "zS6JelvgMj6edYERFXVCXaDNhm+sOqWSQ9YeRCnn6iM="
        # (16 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.broker_solrcloud.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
        id                         = "1363967d-2299-468d-acca-6d7e9f11ae90"
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-solrcloud"
      ~ source_code_hash           = "L5X7otaivMCKDfhOaWCgyLxOT6UGpGWGgUWjAQ/iq18=" -> "kcLMLIIJJmQpY4MkEgxJHTA0HU4dU2qC7wJJClvE0hE="
        # (18 unchanged attributes hidden)


      ~ service_binding {
          ~ service_instance = "1cac946a-e89e-4378-8049-788c278d45ce" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
        # (2 unchanged blocks hidden)
    }

  # module.broker_solrcloud.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/development"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_change                   = true -> false
        id                               = "b40a8df6-95e3-47e8-ad86-961c205bf761"
        name                             = "ssb-solrcloud-gsa-datagov-development"
        # (8 unchanged attributes hidden)
    }

  # module.broker_solrcloud.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_change                   = true -> false
        id                               = "befde70c-d7f5-4ab7-9322-3d7bcf79ab65"
        name                             = "ssb-solrcloud-gsa-datagov-management"
        # (8 unchanged attributes hidden)
    }

  # module.broker_solrcloud.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/prod"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_change                   = true -> false
        id                               = "cb61fcbe-5081-40ae-9043-1da3d451f86d"
        name                             = "ssb-solrcloud-gsa-datagov-prod"
        # (8 unchanged attributes hidden)
    }

  # module.broker_solrcloud.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/staging"] will be updated in-place
  ~ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_change                   = true -> false
        id                               = "5f3847a2-05c2-45d7-8ee0-ef254c6ccbb1"
        name                             = "ssb-solrcloud-gsa-datagov-staging"
        # (8 unchanged attributes hidden)
    }

  # module.brokerpak-eks-terraform.module.bind.data.aws_eks_cluster.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "main"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "k8s-d6e0b7fc580c3a4d"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.bind.data.aws_eks_cluster_auth.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "main"  {
      + id    = (known after apply)
      + name  = "k8s-d6e0b7fc580c3a4d"
      + token = (sensitive value)
    }

  # module.brokerpak-eks-terraform.module.bind.data.kubernetes_secret.secret will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_secret" "secret"  {
      + data      = (sensitive value)
      + id        = (known after apply)
      + immutable = (known after apply)
      + type      = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.bind.data.template_file.kubeconfig will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "kubeconfig"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.bind.kubernetes_role_binding.binding will be created
  + resource "kubernetes_role_binding" "binding" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Role"
          + name      = "namespace-admin"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = (known after apply)
          + namespace = "default"
        }
    }

  # module.brokerpak-eks-terraform.module.bind.kubernetes_service_account.account will be created
  + resource "kubernetes_service_account" "account" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.bind.random_id.name will be created
  + resource "random_id" "name" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.data.aws_eks_cluster.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "main"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.data.aws_eks_cluster_auth.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "main"  {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.brokerpak-eks-terraform.module.provision.data.aws_lb.ingress_nlb will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lb" "ingress_nlb"  {
      + access_logs                = (known after apply)
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + customer_owned_ipv4_pool   = (known after apply)
      + desync_mitigation_mode     = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = (known after apply)
      + enable_deletion_protection = (known after apply)
      + enable_http2               = (known after apply)
      + enable_waf_fail_open       = (known after apply)
      + id                         = (known after apply)
      + idle_timeout               = (known after apply)
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = (known after apply)
      + name                       = "solrcloud-k8s"
      + security_groups            = (known after apply)
      + subnet_mapping             = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.data.kubernetes_secret.secret will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_secret" "secret"  {
      + data      = (sensitive value)
      + id        = (known after apply)
      + immutable = (known after apply)
      + type      = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.data.kubernetes_service.ingress_service will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "ingress_service"  {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ingress-nginx-controller"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.data.template_file.admin_kubeconfig will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "admin_kubeconfig"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.data.template_file.kubeconfig will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "kubeconfig"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.aws_acm_certificate.cert will be created
  + resource "aws_acm_certificate" "cert" {
      + arn                       = (known after apply)
      + domain_name               = "solrcloud-k8s.ssb.data.gov"
      + domain_validation_options = [
          + {
              + domain_name           = "*.solrcloud-k8s.ssb.data.gov"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "solrcloud-k8s.ssb.data.gov"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.solrcloud-k8s.ssb.data.gov",
        ]
      + tags                      = {
          + "domain"      = "solrcloud-k8s.ssb.data.gov"
          + "environment" = "k8s-d6e0b7fc580c3a4d"
        }
      + tags_all                  = {
          + "domain"      = "solrcloud-k8s.ssb.data.gov"
          + "environment" = "k8s-d6e0b7fc580c3a4d"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.brokerpak-eks-terraform.module.provision.aws_acm_certificate_validation.cert will be created
  + resource "aws_acm_certificate_validation" "cert" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.aws_iam_policy.ebs-usage will be created
  + resource "aws_iam_policy" "ebs-usage" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "k8s-d6e0b7fc580c3a4d-ebs-policy"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.aws_iam_policy.pod-logging will be created
  + resource "aws_iam_policy" "pod-logging" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "k8s-d6e0b7fc580c3a4d-pod-logging"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "logs:DescribeLogStreams",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.aws_iam_role.external_dns will be created
  + resource "aws_iam_role" "external_dns" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "k8s-d6e0b7fc580c3a4d-external-dns"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.aws_iam_role_policy.external_dns will be created
  + resource "aws_iam_role_policy" "external_dns" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "k8s-d6e0b7fc580c3a4d-external-dns"
      + policy      = (known after apply)
      + role        = "k8s-d6e0b7fc580c3a4d-external-dns"
    }

  # module.brokerpak-eks-terraform.module.provision.aws_iam_role_policy_attachment.ebs-usage["system_node_group"] will be created
  + resource "aws_iam_role_policy_attachment" "ebs-usage" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.aws_iam_role_policy_attachment.pod-logging["system_node_group"] will be created
  + resource "aws_iam_role_policy_attachment" "pod-logging" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.aws_kms_alias.cluster will be created
  + resource "aws_kms_alias" "cluster" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/DNSSEC-solrcloud-k8s"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.aws_kms_key.cluster will be created
  + resource "aws_kms_key" "cluster" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "*************"
      + deletion_window_in_days            = 7
      + description                        = (known after apply)
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "SIGN_VERIFY"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "kms:DescribeKey",
                          + "kms:GetPublicKey",
                          + "kms:Sign",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dnssec-route53.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow Route 53 DNSSEC Service"
                    },
                  + {
                      + Action    = "kms:CreateGrant"
                      + Condition = {
                          + Bool = {
                              + kms:GrantIsForAWSResource = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dnssec-route53.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow Route 53 DNSSEC Service to CreateGrant"
                    },
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags_all                           = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.aws_kms_key.ebs-key will be created
  + resource "aws_kms_key" "ebs-key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "*****************"
      + deletion_window_in_days            = 7
      + description                        = "k8s-d6e0b7fc580c3a4d-ebs-key"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags_all                           = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.aws_route53_hosted_zone_dnssec.cluster will be created
  + resource "aws_route53_hosted_zone_dnssec" "cluster" {
      + hosted_zone_id = (known after apply)
      + id             = (known after apply)
      + signing_status = "SIGNING"
    }

  # module.brokerpak-eks-terraform.module.provision.aws_route53_key_signing_key.cluster will be created
  + resource "aws_route53_key_signing_key" "cluster" {
      + digest_algorithm_mnemonic  = (known after apply)
      + digest_algorithm_type      = (known after apply)
      + digest_value               = (known after apply)
      + dnskey_record              = (known after apply)
      + ds_record                  = (known after apply)
      + flag                       = (known after apply)
      + hosted_zone_id             = (known after apply)
      + id                         = (known after apply)
      + key_management_service_arn = (known after apply)
      + key_tag                    = (known after apply)
      + name                       = "solrcloud-k8s.ssb.data.gov"
      + public_key                 = (known after apply)
      + signing_algorithm_mnemonic = (known after apply)
      + signing_algorithm_type     = (known after apply)
      + status                     = "ACTIVE"
    }

  # module.brokerpak-eks-terraform.module.provision.aws_route53_record.cert_validation will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.aws_route53_record.cluster-ds will be created
  + resource "aws_route53_record" "cluster-ds" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "solrcloud-k8s.ssb.data.gov"
      + records         = (known after apply)
      + ttl             = 30
      + type            = "DS"
      + zone_id         = "********************"
    }

  # module.brokerpak-eks-terraform.module.provision.aws_route53_record.cluster-ns will be created
  + resource "aws_route53_record" "cluster-ns" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "solrcloud-k8s.ssb.data.gov"
      + records         = (known after apply)
      + ttl             = 30
      + type            = "NS"
      + zone_id         = "********************"
    }

  # module.brokerpak-eks-terraform.module.provision.aws_route53_record.nlb will be created
  + resource "aws_route53_record" "nlb" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "solrcloud-k8s.ssb.data.gov"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.aws_route53_zone.cluster will be created
  + resource "aws_route53_zone" "cluster" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = true
      + id            = (known after apply)
      + name          = "solrcloud-k8s.ssb.data.gov"
      + name_servers  = (known after apply)
      + tags          = {
          + "Environment" = "k8s-d6e0b7fc580c3a4d"
          + "domain"      = "solrcloud-k8s.ssb.data.gov"
        }
      + tags_all      = {
          + "Environment" = "k8s-d6e0b7fc580c3a4d"
          + "domain"      = "solrcloud-k8s.ssb.data.gov"
        }
      + zone_id       = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.aws_wafv2_web_acl.waf_acl will be created
  + resource "aws_wafv2_web_acl" "waf_acl" {
      + arn         = (known after apply)
      + capacity    = (known after apply)
      + description = "EKS WAF rule"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "eks-k8s-d6e0b7fc580c3a4d"
      + scope       = "REGIONAL"
      + tags        = {
          + "EKSCluster" = "k8s-d6e0b7fc580c3a4d"
        }
      + tags_all    = {
          + "EKSCluster" = "k8s-d6e0b7fc580c3a4d"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "AWS-AWSManagedRulesAmazonIpReputationList"
          + priority = 5

          + override_action {
              + count {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AWS-AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWS-AWSManagedRulesCommonRuleSet"
          + priority = 0

          + override_action {
              + count {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AWS-AWSManagedRulesCommonRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWS-AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 1

          + override_action {
              + count {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AWS-AWSManagedRulesKnownBadInputsRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWS-AWSManagedRulesLinuxRuleSet"
          + priority = 4

          + override_action {
              + count {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesLinuxRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AWS-AWSManagedRulesLinuxRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWS-AWSManagedRulesSQLiRuleSet"
          + priority = 2

          + override_action {
              + count {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesSQLiRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AWS-AWSManagedRulesSQLiRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWS-AWSManagedRulesUnixRuleSet"
          + priority = 3

          + override_action {
              + count {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesUnixRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AWS-AWSManagedRulesUnixRuleSet"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = false
          + metric_name                = "eks-k8s-d6e0b7fc580c3a4d"
          + sampled_requests_enabled   = true
        }
    }

  # module.brokerpak-eks-terraform.module.provision.helm_release.external_dns will be created
  + resource "helm_release" "external_dns" {
      + atomic                     = true
      + chart                      = "external-dns"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-dns"
      + namespace                  = "kube-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/external-dns"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "1.7.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "logLevel"
          + value = "info"
        }
      + set {
          + name  = "policy"
          + value = "sync"
        }
      + set {
          + name  = "provider"
          + value = "aws"
        }
      + set {
          + name  = "rbac.create"
          + value = "false"
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "external-dns"
        }
      + set {
          + name  = "sources"
          + value = "{ingress}"
        }
      + set {
          + name  = "txtPrefix"
          + value = "edns-"
        }
    }

  # module.brokerpak-eks-terraform.module.provision.helm_release.ingress_nginx will be created
  + resource "helm_release" "ingress_nginx" {
      + atomic                     = false
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = true
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ingress-nginx"
      + namespace                  = "kube-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + values                     = [
          + <<-EOT
                controller: 
                  image: 
                    allowPrivilegeEscalation: false
            EOT,
        ]
      + verify                     = false
      + version                    = "4.0.17"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "aws_iam_role_arn"
          + value = (known after apply)
        }
      + set {
          + name  = "clusterName"
          + value = (known after apply)
        }
      + set {
          + name  = "controller.autoscaling.enabled"
          + value = "true"
        }
      + set {
          + name  = "controller.autoscaling.maxReplicas"
          + value = "1"
        }
      + set {
          + name  = "controller.autoscaling.minReplicas"
          + value = "1"
        }
      + set {
          + name  = "controller.config.compute-full-forwarded-for"
          + value = "true"
        }
      + set {
          + name  = "controller.config.server-tokens"
          + value = "false"
        }
      + set {
          + name  = "controller.config.use-forwarded-headers"
          + value = "true"
        }
      + set {
          + name  = "controller.config.use-proxy-protocol"
          + value = "true"
        }
      + set {
          + name  = "controller.extraArgs.publish-status-address"
          + value = "solrcloud-k8s.ssb.data.gov"
        }
      + set {
          + name  = "controller.ingressClassResource.default"
          + value = "true"
        }
      + set {
          + name  = "controller.metrics.enabled"
          + value = "true"
        }
      + set {
          + name  = "controller.publishService.enabled"
          + value = "false"
        }
      + set {
          + name  = "controller.service.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-backend-protocol"
          + value = "ssl"
        }
      + set {
          + name  = "controller.service.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-name"
          + value = "solrcloud-k8s"
        }
      + set {
          + name  = "controller.service.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-nlb-target-type"
          + value = "ip"
        }
      + set {
          + name  = "controller.service.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-proxy-protocol"
          + value = "*"
        }
      + set {
          + name  = "controller.service.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-scheme"
          + value = "internet-facing"
        }
      + set {
          + name  = "controller.service.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-ssl-cert"
          + value = (known after apply)
        }
      + set {
          + name  = "controller.service.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-ssl-negotiation-policy"
          + value = "ELBSecurityPolicy-TLS-1-2-2017-01"
        }
      + set {
          + name  = "controller.service.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-ssl-ports"
          + value = "https"
        }
      + set {
          + name  = "controller.service.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-type"
          + value = "external"
        }
      + set {
          + name  = "controller.service.externalTrafficPolicy"
          + value = "Local"
        }
      + set {
          + name  = "controller.service.type"
          + value = "LoadBalancer"
        }
      + set {
          + name  = "rbac.create"
          + value = "true"
        }
      + set {
          + name  = "region"
          + value = "us-west-2"
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "true"
        }
      + set {
          + name  = "vpcId"
          + value = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.helm_release.solr-operator will be created
  + resource "helm_release" "solr-operator" {
      + atomic                     = false
      + chart                      = "solr-operator"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "solr"
      + namespace                  = "kube-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://solr.apache.org/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.5.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "zookeeper-operator.install"
          + value = "false"
        }
      + set {
          + name  = "zookeeper-operator.use"
          + value = "true"
        }
    }

  # module.brokerpak-eks-terraform.module.provision.helm_release.zookeeper-operator will be created
  + resource "helm_release" "zookeeper-operator" {
      + atomic                     = false
      + chart                      = "zookeeper-operator"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "zookeeper"
      + namespace                  = "kube-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.pravega.io/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.2.12"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "hooks.delete"
          + value = "false"
        }
    }

  # module.brokerpak-eks-terraform.module.provision.kubernetes_cluster_role.external_dns will be created
  + resource "kubernetes_cluster_role" "external_dns" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "external-dns"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "",
            ]
          + resources  = [
              + "services",
              + "pods",
              + "nodes",
              + "endpoints",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
      + rule {
          + api_groups = [
              + "extensions",
              + "networking.k8s.io",
            ]
          + resources  = [
              + "ingresses",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
      + rule {
          + api_groups = [
              + "networking.istio.io",
            ]
          + resources  = [
              + "gateways",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
    }

  # module.brokerpak-eks-terraform.module.provision.kubernetes_cluster_role_binding.admin will be created
  + resource "kubernetes_cluster_role_binding" "admin" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = (known after apply)
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "cluster-admin"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = (known after apply)
          + namespace = "kube-system"
        }
    }

  # module.brokerpak-eks-terraform.module.provision.kubernetes_cluster_role_binding.external_dns will be created
  + resource "kubernetes_cluster_role_binding" "external_dns" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "external-dns"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "external-dns"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "external-dns"
          + namespace = "kube-system"
        }
    }

  # module.brokerpak-eks-terraform.module.provision.kubernetes_config_map.logging will be created
  + resource "kubernetes_config_map" "logging" {
      + data = {
          + "output.conf" = <<-EOT
                [OUTPUT]
                  Name cloudwatch_logs
                  Match   *
                  region us-west-2
                  log_group_name fluent-bit-cloudwatch-k8s-d6e0b7fc580c3a4d
                  log_stream_prefix from-fluent-bit-
                  auto_create_group true
            EOT
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "aws-logging"
          + namespace        = "aws-observability"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.kubernetes_namespace.logging will be created
  + resource "kubernetes_namespace" "logging" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "aws-observability" = "enabled"
            }
          + name             = "aws-observability"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.kubernetes_role.namespace_admin will be created
  + resource "kubernetes_role" "namespace_admin" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "namespace-admin"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "*",
            ]
          + resources  = [
              + "*",
            ]
          + verbs      = [
              + "*",
            ]
        }
    }

  # module.brokerpak-eks-terraform.module.provision.kubernetes_service_account.admin will be created
  + resource "kubernetes_service_account" "admin" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.kubernetes_service_account.external_dns will be created
  + resource "kubernetes_service_account" "external_dns" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "external-dns"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.kubernetes_storage_class.ebs-sc will be created
  + resource "kubernetes_storage_class" "ebs-sc" {
      + allow_volume_expansion = true
      + id                     = (known after apply)
      + parameters             = (known after apply)
      + reclaim_policy         = "Delete"
      + storage_provisioner    = "kubernetes.io/aws-ebs"
      + volume_binding_mode    = "Immediate"

      + metadata {
          + generation       = (known after apply)
          + name             = "ebs-sc"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "kubeconfig-k8s-d6e0b7fc580c3a4d"
      + id                   = (known after apply)
      + sensitive_content    = (sensitive value)
    }

  # module.brokerpak-eks-terraform.module.provision.null_resource.cluster-functional will be created
  + resource "null_resource" "cluster-functional" {
      + id = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.null_resource.prerequisite_binaries_present will be created
  + resource "null_resource" "prerequisite_binaries_present" {
      + id = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.random_id.name will be created
  + resource "random_id" "name" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.time_sleep.alb_controller_destroy_delay will be created
  + resource "time_sleep" "alb_controller_destroy_delay" {
      + destroy_duration = "60s"
      + id               = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_eks_cluster.selected[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "selected"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_eks_cluster_auth.selected[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "selected"  {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_iam_policy_document.eks_oidc_assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "eks_oidc_assume_role"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-load-balancer-controller",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_region.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_region" "current"  {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = "us-west-2"
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_vpc.selected will be read during apply
  # (config refers to values not yet known)
 <= data "aws_vpc" "selected"  {
      + arn                     = (known after apply)
      + cidr_block              = (known after apply)
      + cidr_block_associations = (known after apply)
      + default                 = (known after apply)
      + dhcp_options_id         = (known after apply)
      + enable_dns_hostnames    = (known after apply)
      + enable_dns_support      = (known after apply)
      + id                      = (known after apply)
      + instance_tenancy        = (known after apply)
      + ipv6_association_id     = (known after apply)
      + ipv6_cidr_block         = (known after apply)
      + main_route_table_id     = (known after apply)
      + owner_id                = (known after apply)
      + state                   = (known after apply)
      + tags                    = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.template_file.kubeconfig will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "kubeconfig"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = (sensitive)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn         = (known after apply)
      + description = "Permissions that are required to manage AWS Application Load Balancers."
      + id          = (known after apply)
      + name        = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "iam:CreateServiceLinkedRole"
                      + Condition = {
                          + StringEquals = {
                              + iam:AWSServiceName = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeCoipPools",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:AssociateWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:AssociateWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:CreateProtection",
                          + "shield:DeleteProtection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + aws:RequestTag/elbv2.k8s.aws/cluster = "false"
                            }
                          + StringEquals = {
                              + ec2:CreateAction = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + Null = {
                              + aws:RequestTag/elbv2.k8s.aws/cluster  = "true"
                              + aws:ResourceTag/elbv2.k8s.aws/cluster = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + aws:ResourceTag/elbv2.k8s.aws/cluster = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + aws:RequestTag/elbv2.k8s.aws/cluster = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Condition = {
                          + Null = {
                              + aws:RequestTag/elbv2.k8s.aws/cluster  = "true"
                              + aws:ResourceTag/elbv2.k8s.aws/cluster = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + aws:ResourceTag/elbv2.k8s.aws/cluster = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "Permissions required by the Kubernetes AWS Load Balancer controller to do its job."
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
      + tags_all              = {
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.aws_iam_role_policy_attachment.this will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.helm_release.alb_controller will be created
  + resource "helm_release" "alb_controller" {
      + atomic                     = true
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 900
      + verify                     = false
      + version                    = "1.3.3"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = (known after apply)
        }
      + set {
          + name  = "hostNetwork"
          + value = "false"
        }
      + set {
          + name  = "region"
          + value = "us-west-2"
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller"
        }
      + set {
          + name  = "vpcId"
          + value = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.kubernetes_cluster_role.this will be created
  + resource "kubernetes_cluster_role" "this" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "terraform"
              + "app.kubernetes.io/name"       = "aws-load-balancer-controller"
            }
          + name             = "aws-load-balancer-controller"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "",
              + "extensions",
            ]
          + resources  = [
              + "configmaps",
              + "endpoints",
              + "events",
              + "ingresses",
              + "ingresses/status",
              + "services",
            ]
          + verbs      = [
              + "create",
              + "get",
              + "list",
              + "update",
              + "watch",
              + "patch",
            ]
        }
      + rule {
          + api_groups = [
              + "",
              + "extensions",
            ]
          + resources  = [
              + "nodes",
              + "pods",
              + "secrets",
              + "services",
              + "namespaces",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.kubernetes_cluster_role_binding.this will be created
  + resource "kubernetes_cluster_role_binding" "this" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "terraform"
              + "app.kubernetes.io/name"       = "aws-load-balancer-controller"
            }
          + name             = "aws-load-balancer-controller"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "aws-load-balancer-controller"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "aws-load-balancer-controller"
          + namespace = "kube-system"
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.kubernetes_service_account.this will be created
  + resource "kubernetes_service_account" "this" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/component"  = "controller"
              + "app.kubernetes.io/managed-by" = "terraform"
              + "app.kubernetes.io/name"       = "aws-load-balancer-controller"
            }
          + name             = "aws-load-balancer-controller"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this"  {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/eks/k8s-d6e0b7fc580c3a4d/cluster"
      + retention_in_days = 180
      + tags              = {
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
      + tags_all          = {
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name        = "aws-ebs-csi-driver"
      + addon_version     = (known after apply)
      + arn               = (known after apply)
      + cluster_name      = "k8s-d6e0b7fc580c3a4d"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags              = {
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
      + tags_all          = {
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name        = "coredns"
      + addon_version     = (known after apply)
      + arn               = (known after apply)
      + cluster_name      = "k8s-d6e0b7fc580c3a4d"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags              = {
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
      + tags_all          = {
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name    = "kube-proxy"
      + addon_version = (known after apply)
      + arn           = (known after apply)
      + cluster_name  = "k8s-d6e0b7fc580c3a4d"
      + created_at    = (known after apply)
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + tags          = {
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
      + tags_all      = {
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name        = "vpc-cni"
      + addon_version     = (known after apply)
      + arn               = (known after apply)
      + cluster_name      = "k8s-d6e0b7fc580c3a4d"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags              = {
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
      + tags_all          = {
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "k8s-d6e0b7fc580c3a4d"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
      + tags_all                  = {
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
      + version                   = "1.21"

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
        }

      + timeouts {
          + delete = "20m"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Name"   = "k8s-d6e0b7fc580c3a4d-eks-irsa"
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
      + tags_all        = {
          + "Name"   = "k8s-d6e0b7fc580c3a4d-eks-irsa"
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "k8s-d6e0b7fc580c3a4d-cluster-"
      + path                  = "/"
      + tags                  = {
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
      + tags_all              = {
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "k8s-d6e0b7fc580c3a4d-cluster-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"   = "k8s-d6e0b7fc580c3a4d-cluster"
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
      + tags_all               = {
          + "Name"   = "k8s-d6e0b7fc580c3a4d-cluster"
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
      + vpc_id                 = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_security_group.node[0] will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "EKS node shared security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "k8s-d6e0b7fc580c3a4d-node-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                                       = "k8s-d6e0b7fc580c3a4d-node"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "owned"
        }
      + tags_all               = {
          + "Name"                                       = "k8s-d6e0b7fc580c3a4d-node"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "owned"
        }
      + vpc_id                 = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_security_group_rule.cluster["egress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_security_group_rule.cluster["egress_nodes_kubelet"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "egress"
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_security_group_rule.node["egress_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Node all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_security_group_rule.node["egress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_security_group_rule.node["egress_https"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress all HTTPS to internet"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_security_group_rule.node["egress_ntp_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress NTP/TCP to internet"
      + from_port                = 123
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 123
      + type                     = "egress"
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_security_group_rule.node["egress_ntp_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress NTP/UDP to internet"
      + from_port                = 123
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 123
      + type                     = "egress"
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "egress"
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_security_group_rule.node["egress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "egress"
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_security_group_rule.node["ingress_allow_alb_controller_access_from_control_plane"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "control plane to AWS load balancer controller"
      + from_port                = 9443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9443
      + type                     = "ingress"
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_security_group_rule.node["ingress_allow_ingress_access_from_control_plane"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "control plane to ingress nginx controller"
      + from_port                = 8443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8443
      + type                     = "ingress"
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_security_group_rule.node["ingress_self_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node all ports/protocols"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.brokerpak-eks-terraform.module.provision.module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"                                       = "eks-vpc-us-west-2a"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
        }
      + tags_all             = {
          + "Name"                                       = "eks-vpc-us-west-2a"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
        }
      + vpc                  = true
    }

  # module.brokerpak-eks-terraform.module.provision.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"                                       = "eks-vpc"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
        }
      + tags_all = {
          + "Name"                                       = "eks-vpc"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
        }
      + vpc_id   = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"                                       = "eks-vpc-us-west-2a"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
        }
      + tags_all             = {
          + "Name"                                       = "eks-vpc-us-west-2a"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                                       = "eks-vpc-private"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
        }
      + tags_all         = {
          + "Name"                                       = "eks-vpc-private"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
        }
      + vpc_id           = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                                       = "eks-vpc-public"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
        }
      + tags_all         = {
          + "Name"                                       = "eks-vpc-public"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
        }
      + vpc_id           = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.31.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                       = "eks-vpc-private-us-west-2a"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
          + "kubernetes.io/role/internal-elb"            = "1"
        }
      + tags_all                                       = {
          + "Name"                                       = "eks-vpc-private-us-west-2a"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
          + "kubernetes.io/role/internal-elb"            = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.31.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                       = "eks-vpc-private-us-west-2b"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
          + "kubernetes.io/role/internal-elb"            = "1"
        }
      + tags_all                                       = {
          + "Name"                                       = "eks-vpc-private-us-west-2b"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
          + "kubernetes.io/role/internal-elb"            = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.31.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                       = "eks-vpc-private-us-west-2c"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
          + "kubernetes.io/role/internal-elb"            = "1"
        }
      + tags_all                                       = {
          + "Name"                                       = "eks-vpc-private-us-west-2c"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
          + "kubernetes.io/role/internal-elb"            = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.31.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                       = "eks-vpc-public-us-west-2a"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
          + "kubernetes.io/role/elb"                     = "1"
        }
      + tags_all                                       = {
          + "Name"                                       = "eks-vpc-public-us-west-2a"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
          + "kubernetes.io/role/elb"                     = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.31.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                       = "eks-vpc-public-us-west-2b"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
          + "kubernetes.io/role/elb"                     = "1"
        }
      + tags_all                                       = {
          + "Name"                                       = "eks-vpc-public-us-west-2b"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
          + "kubernetes.io/role/elb"                     = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.31.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                       = "eks-vpc-public-us-west-2c"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
          + "kubernetes.io/role/elb"                     = "1"
        }
      + tags_all                                       = {
          + "Name"                                       = "eks-vpc-public-us-west-2c"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
          + "kubernetes.io/role/elb"                     = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "10.31.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"                                       = "eks-vpc"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
        }
      + tags_all                             = {
          + "Name"                                       = "eks-vpc"
          + "domain"                                     = "solrcloud-k8s.ssb.data.gov"
          + "kubernetes.io/cluster/k8s-d6e0b7fc580c3a4d" = "shared"
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.module.eks_managed_node_group["system_node_group"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "k8s-d6e0b7fc580c3a4d"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "m4.xlarge",
        ]
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "mng-d6e0b7fc580c3a4d-"
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Name"   = "mng-d6e0b7fc580c3a4d"
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
      + tags_all               = {
          + "Name"   = "mng-d6e0b7fc580c3a4d"
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
      + version                = "1.21"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 14
          + max_size     = 14
          + min_size     = 1
        }

      + timeouts {}

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.module.eks_managed_node_group["system_node_group"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "mng-d6e0b7fc580c3a4d-eks-node-group-"
      + path                  = "/"
      + tags                  = {
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
      + tags_all              = {
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.module.eks_managed_node_group["system_node_group"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.module.eks_managed_node_group["system_node_group"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.module.eks_managed_node_group["system_node_group"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.module.eks_managed_node_group["system_node_group"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for mng-d6e0b7fc580c3a4d EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "system_node_group-"
      + tags                   = {
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
      + tags_all               = {
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
      + update_default_version = true
      + vpc_security_group_ids = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "********"
          + instance_metadata_tags      = "disabled"
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"   = "mng-d6e0b7fc580c3a4d"
              + "domain" = "solrcloud-k8s.ssb.data.gov"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name"   = "mng-d6e0b7fc580c3a4d"
              + "domain" = "solrcloud-k8s.ssb.data.gov"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name"   = "mng-d6e0b7fc580c3a4d"
              + "domain" = "solrcloud-k8s.ssb.data.gov"
            }
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.eks.module.eks_managed_node_group["system_node_group"].aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "EKS managed node group security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "mng-d6e0b7fc580c3a4d-eks-node-group-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"   = "mng-d6e0b7fc580c3a4d-eks-node-group"
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
      + tags_all               = {
          + "Name"   = "mng-d6e0b7fc580c3a4d-eks-node-group"
          + "domain" = "solrcloud-k8s.ssb.data.gov"
        }
      + vpc_id                 = (known after apply)
    }

Plan: 106 to add, 6 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [plan #198](https://github.com/GSA/datagov-ssb/actions/runs/1929344657)